#!/usr/bin/env python
# coding: utf-8

# In[ ]:


#https://github.com/eellak/gsoc2018-spacy/blob/dev/spacy/lang/el/stop_words.py
# we use more stop words from the commit above, 
# people to reference Markos Gogoulos, Giannis Daras
# and also we add some of our own stop words

from __future__ import unicode_literals

# new line when we have change of letter
STOP_WORDS = set("""
άλλα άλλες άλλη άλλο άλλοι άλλους άλλων άνω ακόμα ακόμη αλλά αμέσως αν
ανά ανάμεσα απ από αρκετά αρκετές αυτά αυτές αυτή αυτήν αυτής αυτοί αυτού
αυτούς αυτό αυτόν αυτός αυτών αφορά αφού αυτή αυτοί α 
β βρε
γίνει γίνεται για γιατί γ
δε δείτε δεν δείνα δηλαδή διάφορα διάφορες δυο δύο δικός δική δικό δ δω
έγιναν έγινε εγώ έκανε ένα έναν ένας έξι έπειτα έτσι έχει έχοντας έχουν ε
έως είναι είτε είχαν είχε εαυτό εγώ εις εκ εκεί εκείνη εκτός εμάς εμείς εμένα ένα εναντίον ένας έναν
εντός ενός ενώ εξ εξής εξαιτίας επί επίσης επειδή επιπλέον επόμενη εσείς εσένα εσάς εσύ
εαυτός εαυτή εαυτό εαυτού εαυτών εδώ έχω είχα είχες είχαμε είχατε είχαν
ζ 
ήδη ήταν η 
θα θ
ίδια ίδιο ίδιος ίσως ιδία ίδιοι ι
καμία καμιά κανείς κανένα κάθε καθένας καθεμία καθένα καθετί κάποια κάποιες κάποιο κάποιος κάποιοι κάτι κάτω καθώς και κατά κι
κ
λ λόγω λίγο λίγος λίγη λιγότερο λίγα 
μ μάλιστα μέσα μέσω μέχρι μία μαζί μας με μερικές μεσώ μετά
μεταξύ μη μην μια μιας μου μόνο
μερικός μερική μερικό μερικοί μερικά
ν να ναι
ξ ξανά 
οι οποία οποίας οποίες οποίο οποίοι οποίος οποίου οποίων οπότε ο 
ος ου ούτε όλο όλοι όλων όμως όποια όποιες όποιο όποιοι όποιος όπου όπως όσο όσες όσα όσοι όταν
όλα όλες όλη ότι όχι οτι ολίγον
π πάλι πάντα πάνω παρά περί περίπου πιο πλέον πολλά πολλές πολλοί
πολλούς πολύ πολύς ποτέ που πού πρέπει πριν προς πρώτα πρώτες πρώτη πρώτο
πρώτος πως πώς πίσω
ποιος ποια ποιο ποιοι ποιων ποιες ποια ποιους ποιανού ποιανής ποιανών 
ρ
σ σαν σε σου στα στη στην στις στο στον στους
τ τα τες τη την της τι τις το τοι τον του τους τού τούς τρία τρίτη των 
τρεις των τόσο τότε τελευταίος τελευταία τελευταίο
τούτο τέτοιος τέτοιο τέτοια τέτοιοι
τίποτα τίποτε τάδε
υ υπό
φ χ ψ ω
ως ωστόσο  ώστε'
""".split())

